
{
  "data": [
    {
      "name": "Steve J.",
      "link": "../images/stars.png",
      "text": "Jay and Pete were very professional and made sure my roof was completed. Not only is the new roof great, they cleaned up as if they were never here! Very thankful, would recommend!"
    },
    {
      "name": "Genevieve F.",
      "link": "../images/stars.png",
      "text": "These guys did an amazing job on my roof! If you ever need work on your house, these guys are the best."
    },
    {
      "name": "Kristina H.",
      "link": "../images/stars.png",
      "text": "The idea of doing a major exterior renovation on our home seemed overwhelming. Until we met Peter and got the project underway. From start to finish, working with him, Jay & their Team was a positive experience! They were always patient, professional and gave us sound advice, on material quality, options, and structure. When the project began, they were thorough and diligent. At each step we were always told their goal is to make us happy and that they are easy to work with. Hard to believe yet, so true! We are very happy with the result. They turned our vision into reality. Our neighbors have been complimenting us too. We’re glad to have found such a great contractor and grateful that we worked with such nice people, Peter, Jay, and their Team. We highly recommend SA Construction!"
    },
    {
      "name": "Debbie A.",
      "link": "../images/stars.png",
      "text": "Prompt, professional and accommodating to last minute design changes. Would recommend to my family, friends and neighbors"
    },
    {
      "name": "Sister Jo Ann L.",
      "link": "../images/stars.png",
      "text": "The work was excellent. I was very satisfied with their work. I would use their service again to do more work."
    },
    {
      "name": "Jen T.",
      "link": "../images/stars.png",
      "text": "I’m SO happy I found this company! Jay, Mike, Pete and their team are amazing. I closed on a new house the first week in March of 2020 knowing I had to replace the roof , siding, gutters etc. We all know what happened a week later! It’s been EXTREMELY difficult and stressful to find contractors/get anything done. After at least SIX quotes for my job over a period of many months, I finally found SA! Their quote was by far superior in every way: They didn’t give me a 45 minute PowerPoint with a salesperson, they showed up themselves, they had the siding I wanted right away, (which is next to impossible right now), they made it simple! They have experience and knowledge and it’s obvious right from the beginning. They understood what I wanted and gave me a fair price. No BS. 😃 Finally! All concerns and questions were addressed during and AFTER the job -they aren’t going to disappear on you ! The job was done fast and professionally. They started within a week of the initial quote and it was done about a week later, even w winter weather! My house looks like a different house! It’s BEAUTIFUL. I couldn’t be happier. THANK YOU SA !"
    }
  ]
}